import pandas as pd
import pytest


@pytest.fixture
def sample_transactions_df():

    return pd.DataFrame(
        [
            {
                "Дата операции": "20.12.2021 10:00:00",
                "Категория": "Супермаркеты",
                "Описание": "Лента",
                "Сумма операции": -500.0,
                "Сумма операции с округлением": -500.0,
                "Номер карты": "1234567812345814",
            },
            {
                "Дата операции": "21.12.2021 12:00:00",
                "Категория": "Супермаркеты",
                "Описание": "Пятёрочка",
                "Сумма операции": -300.0,
                "Сумма операции с округлением": -300.0,
                "Номер карты": "1234567812345814",
            },
            {
                "Дата операции": "10.12.2021 09:00:00",
                "Категория": "ЖКХ",
                "Описание": "Квартира",
                "Сумма операции": -2000.0,
                "Сумма операции с округлением": -2000.0,
                "Номер карты": "8765432187657512",
            },
            {
                "Дата операции": "05.01.2022 15:00:00",
                "Категория": "Кафе и рестораны",
                "Описание": "Обед в Бургер Кинг",
                "Сумма операции": -450.0,
                "Сумма операции с округлением": -450.0,
                "Номер карты": "1234567812345814",
            },
            {
                "Дата операции": "07.01.2022 16:00:00",
                "Категория": "Мобильная связь",
                "Описание": "Оплата телефона 89001234567",
                "Сумма операции": -300.0,
                "Сумма операции с округлением": -300.0,
                "Номер карты": "1234567812345814",
            },
            {
                "Дата операции": "07.01.2022 17:00:00",
                "Категория": "Мобильная связь",
                "Описание": "Оплата телефона +7(901)9876543",
                "Сумма операции": -400.0,
                "Сумма операции с округлением": -400.0,
                "Номер карты": "1234567812345814",
            },
        ]
    )
